app/controllers/statuses_controller.rb

  def update
    @unit = Unit.find(params[:unit_id])
---
SELECT "units".* FROM "units" WHERE "units"."id" = 1 LIMIT 1