app/controllers/status_controller.rb

SELECT * FROM "units" WHERE ("units"."id" = 1)
---
  def update
    @unit = Unit.find(params[:unit_id])