app/controllers/units_controller.rb

SELECT "units".* FROM "units"
---
def index
  @unit = Unit.new
  @units = Unit.all

INSERT INTO "units" ("name", "updated_at", "code", "created_at") VALUES('Front Porch', '2008-11-29 07:52:49', 'a2', '2008-11-29 07:52:49')
---
def create
  @unit = Unit.new(params[:unit])
  if @unit.save

SELECT "units".* FROM "units" WHERE "units"."id" = 1 LIMIT 1
---
def show
  @unit = Unit.find(params[:id])

SELECT "units".* FROM "units" WHERE "units"."id" = 2 LIMIT 1
---
def edit
  @unit = Unit.find(params[:id])

SELECT "units".* FROM "units" WHERE "units"."id" = 1 LIMIT 1
UPDATE "units" SET "name" = 'Office Green Lamp', "code" = 'a11', "updated_at" = '2013-08-08 05:40:11.549000' WHERE "units"."id" = 17
---
def update
  @unit = Unit.find(params[:id])
  if @unit.update_attributes(params[:unit])

SELECT * FROM "units" WHERE ("units"."id" = 12)
DELETE FROM "units" WHERE "id" = 12
---
def destroy
  @unit = Unit.find(params[:id])
  @unit.destroy